<!-- dflook/terraform-github-actions {"workspace":"unlock-state","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"2b0b07aaa4cb8b0c1e33302b4e7b7eed8b95a33cc21b03a206b3e78964b2bf1a","plan_job_ref":"Job Test plan target and replace #308 at https://github.com/dflook/terraform-github-actions/actions/runs/4028991200","plan_hash":"8bb5f3bb983472cb23c8755c34d4aa1879cc881061325fdae9b736f914045305","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __unlock-state__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "3WZExxvFKZ" -> (known after apply)
  ~ foreach = "V6jBX8WhJ7" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #308](https://github.com/dflook/terraform-github-actions/actions/runs/4028991200)